# # Taps
# tap 'homebrew/cask-fonts'
# tap 'homebrew/cask-versions'
# tap 'homebrew/bundle'
# tap 'nicoverbruggen/homebrew-cask'
# tap 'stripe/stripe-cli'
#
# # Binaries
# brew 'awscli'
# brew 'bash' # Latest Bash version
# brew 'bat' # Used for spatie/visit
# brew 'coreutils' # Those that come with macOS are outdated
# brew 'ffmpeg'
# brew 'gh'
# brew 'git'
# brew 'grep'
# brew 'httpie'
# brew 'jq' # Used for spatie/visit
# brew 'mackup'
# brew 'mas' # Mac App Store manager
# brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
# brew 'stripe/stripe-cli/stripe'
# brew 'stripe/stripe-mock/stripe-mock'
# brew 'svn' # Needed to install fonts
#
# # Spatie Medialibrary
# brew 'jpegoptim'
# brew 'optipng'
# brew 'pngquant'
# brew 'svgo'
# brew 'gifsicle'
#
# # Development
# brew 'imagemagick'
# brew 'meilisearch'
# brew 'mysql'
# brew 'node'
# brew 'redis'
# brew 'yarn'
#
# # Apps
# cask '1password'
# cask 'caffeine'
# cask 'dbngin'
# cask 'discord'
# cask 'docker'
# cask 'figma'
# cask 'firefox'
# cask 'github'
# cask 'google-chrome'
# cask 'helo'
# cask 'herd'
# cask 'imageoptim'
# cask 'insomnia'
# cask 'pastebot'
# cask 'readdle-spark'
# cask 'screenflow'
# cask 'slack'
# cask 'tableplus'
# cask 'the-unarchiver'
# cask 'tinkerwell'
# cask 'transmit'
# cask 'tunnelbear'
# cask 'tuple'
# cask 'visual-studio-code'
# cask 'zoom'
# cask 'zwift'
#
# # Quicklook
# cask 'qlmarkdown'
# cask 'quicklook-json'
#
# # Fonts
# cask 'font-lato'
# cask 'font-open-sans'
# cask 'font-roboto'
# cask 'font-source-code-pro-for-powerline'
# cask 'font-source-code-pro'
# cask 'font-source-sans-pro'
# cask 'font-source-serif-pro'
#
# # Mac App Store
# mas 'Byword', id: 420212497
# mas 'Giphy Capture', id: 668208984
# mas 'Keynote', id: 409183694
# mas 'Numbers', id: 409203825
# mas 'Speedtest', id: 1153157709
# mas 'Spring', id: 1508706541
# mas 'Things', id: 904280696
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
brew "asdf"
brew "gh"
brew "gnu-sed"
brew "graphviz"
brew "lazygit"
brew "libpq"
brew "neovim"
brew "tmux"
brew "overmind"
brew "postgresql@14", restart_service: true
brew "powerlevel10k"
brew "redis", restart_service: true
brew "ripgrep"
brew "yarn"
brew "heroku/brew/heroku"
cask "font-fira-code-nerd-font"
cask "keycastr"
vscode "eamodio.gitlens"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "misogi.ruby-rubocop"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "Shopify.ruby-lsp"
vscode "twxs.cmake"
vscode "vscodevim.vim"
vscode "WakaTime.vscode-wakatime"
vscode "wingrunr21.vscode-ruby"
